AUTO_config_TK_pesok/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>ОсновнойКонтрагент</name>
      <description>Основной контрагент</description>
    </items>
    <items>
      <name>ЧастноеЛицо</name>
      <description>Частное лицо</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование контрагента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <comment>Вид контрагента</comment>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквзита ЮрФизЛицо.</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлательщикНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоЕДРПОУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСвидетельстваПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИННПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодФилиала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GLN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Дополнительная информация о контрагенте</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодWERA</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаРаботы</name>
    <comment>1 - Корректировка 2 - Замена накладных</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьПротоколыЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерТабак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <comment>Тип</comment>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <comment>Вид</comment>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <comment>Представление</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_УчетнаяПолитикаКонтрагенты/ТК_УчетнаяПолитикаКонтрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_УчетнаяПолитикаКонтрагенты</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>СхемаНалогообложения</name>
    <type>
      <types>EnumRef.СхемыНалогообложения</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮрФизЛицо</name>
  <comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</comment>
  <enumValues>
    <name>ЮрЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ЮрЛицоНеРезидент</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Enums/ВидыКонтрагентов/ВидыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКонтрагентов</name>
  <comment>Виды контрагентов</comment>
  <enumValues>
    <name>Покупатель</name>
    <comment>Основное взаимодествие с контрагентом - продажа, передача на комиссию, хранение</comment>
  </enumValues>
  <enumValues>
    <name>Поставщик</name>
    <comment>Основное взаимодествие с контрагентом - закупка и принятие на комиссию, хранение</comment>
  </enumValues>
  <enumValues>
    <name>ПодотчетноеЛицо</name>
    <comment>Подотчетное лицо компании</comment>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
    <comment>Филиал компании, одна из организаций</comment>
  </enumValues>
  <enumValues>
    <name>Собственник</name>
    <comment>Собственник компании, осуществляющий финансирование</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочие контрагенты</comment>
  </enumValues>
  <enumValues>
    <name>Внутренний</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Catalogs/БанковскиеСчетаКонтрагентов/БанковскиеСчетаКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БанковскиеСчетаКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <owners>Catalog.ФизическиеЛица</owners>
  <attributes>
    <name>ВидСчета</name>
    <comment>(Общ) Расчетный, депозитный, ссудный, иной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>34</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДенежныхСредств</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГородБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресБанка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефоныБанка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <comment>(Общ) Дата открытия счета</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <comment>(Общ) Дата закрытия счета</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИДатаРазрешения</name>
    <comment>(Регл) Номер и дата разрешения открытия счета</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Catalogs/Контрагенты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
Функция ПолучитьСхемуНалообложения(Контрагент, НаДату) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТК_УчетнаяПолитикаКонтрагентыСрезПоследних.СхемаНалогообложения КАК СхемаНалоогобложения
		|ИЗ
		|	РегистрСведений.ТК_УчетнаяПолитикаКонтрагенты.СрезПоследних(&НаДату, Контрагент = &Контрагент) КАК ТК_УчетнаяПолитикаКонтрагентыСрезПоследних";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Неопределено;
	Иначе 
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.СхемаНалоогобложения;		
	КонецЕсли;
	
	
КонецФункции

Функция ПолучитьКлючФоновогоЗаданияПоКонтрагенту(Контрагент) Экспорт

	Возврат СокрЛП(Контрагент.Наименование) + ", UID#" + Контрагент.УникальныйИдентификатор();	

КонецФункции // ПолучитьКлючФоновогоЗаданияПоСкладу()

Функция ПолучитьКонтрагентаПоКлючуФоновогоЗадания(КлючФоновогоЗадания) Экспорт

	ПозицияРазделителя = Найти(КлючФоновогоЗадания, "UID#");
	
	УникальныйИдентификаторКонтрагента = Сред(КлючФоновогоЗадания, ПозицияРазделителя + 4);
	
	Возврат Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(УникальныйИдентификаторКонтрагента));

КонецФункции // ПолучитьСкладПоКлючуФоновогоЗадания()

Функция НайтиКонтрагентаПоЕДРПОУ(Знач ЕДРПОУ)Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =	  "ВЫБРАТЬ ПЕРВЫЕ 1
	 |	Контрагенты.Ссылка КАК Ссылка
	 |ИЗ
	 |	Справочник.Контрагенты КАК Контрагенты
	 |ГДЕ
	 |	Контрагенты.КодПоЕДРПОУ = &КодПоЕДРПОУ";
	Запрос.УстановитьПараметр("КодПоЕДРПОУ",ЕДРПОУ);
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда 
		Возврат Неопределено;
	КонецЕсли;
	Выборка = Рез.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

Функция ПолучитьРеквизитыКонтрагента(Дата, Контрагент)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ВидСчета", "Текущий");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);

	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
	               |	Контрагенты.ЮрФизЛицо КАК ЮрФизЛицо,
	               |	Контрагенты.КодПоЕДРПОУ КАК КодПоЕДРПОУ,
	               |	КонтрагентыКонтактнаяИнформация.Представление КАК Адрес,
	               |	Контрагенты.КодФилиала КАК КодФилиала,
	               |	Контрагенты.ИННПлательщикаНДС КАК ИНН
	               |ИЗ
	               |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	               |		ПРАВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	               |		ПО КонтрагентыКонтактнаяИнформация.Ссылка = Контрагенты.Ссылка
	               |			И (КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	               |ГДЕ
	               |	Контрагенты.Ссылка = &Контрагент
	               |;
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	БанковскиеСчетаКонтрагентов.Ссылка КАК Ссылка,
	               |	БанковскиеСчетаКонтрагентов.НомерСчета КАК НомерСчета,
	               |	БанковскиеСчетаКонтрагентов.КодБанка КАК КодБанка,
	               |	БанковскиеСчетаКонтрагентов.НаименованиеБанка КАК НаименованиеБанка,
	               |	БанковскиеСчетаКонтрагентов.АдресБанка КАК АдресБанка
	               |ИЗ
	               |	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
	               |ГДЕ
	               |	БанковскиеСчетаКонтрагентов.ВидСчета = &ВидСчета
	               |	И БанковскиеСчетаКонтрагентов.Владелец = &Контрагент
	               |	И НЕ БанковскиеСчетаКонтрагентов.Закрыт";
	
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Реквизиты = МассивРезультатов[0].Выбрать();
	ВыборкаБС = МассивРезультатов[1].Выбрать();
						
	Реквизиты.Следующий();
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("НаименованиеПолное",  Реквизиты.НаименованиеПолное);
	СтруктураРеквизитов.Вставить("ЮрЛицо", 			    Реквизиты.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо);
	СтруктураРеквизитов.Вставить("КодПоЕДРПОУ", 		Реквизиты.КодПоЕДРПОУ);		
	СтруктураРеквизитов.Вставить("Адрес", 				Реквизиты.Адрес);		
	СтруктураРеквизитов.Вставить("КодФилиала", 			Реквизиты.КодФилиала);		
	СтруктураРеквизитов.Вставить("ИНН", 				Реквизиты.ИНН);		
	ВыборкаБС.Следующий();
	СтруктураРеквизитов.Вставить("НомерСчета", 			ВыборкаБС.НомерСчета);		
	СтруктураРеквизитов.Вставить("КодБанка", 			ВыборкаБС.КодБанка);		
	СтруктураРеквизитов.Вставить("НаименованиеБанка", 	ВыборкаБС.НаименованиеБанка);		
	СтруктураРеквизитов.Вставить("АдресБанка", 			ВыборкаБС.АдресБанка);		

	Возврат СтруктураРеквизитов;
КонецФункции


#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов


// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами.
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	БлокируемыеРеквизиты.Добавить("Код");
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов


#КонецОбласти

Функция ЭтоВнутреннийКонтрагент(Контрагент) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Ссылка = &Контрагент
	               |	И Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.Внутренний)";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ПолучитьПредставлениеДляПечати(Контрагент, Наименование = Истина, ИНН = Ложь, ЕДРПОУ = Ложь, Адрес = Ложь, НаДату = Неопределено, КодЯзыка = Неопределено, Разделитель = ", ", ПолучитьСтруктуру = Ложь) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НаДату = Неопределено Тогда 
		НаДату = ТекущаяДата();
	КонецЕсли;
	
	Если КодЯзыка = Неопределено Тогда 
		КодЯзыка = Лев(КодЛокализацииИнформационнойБазы(), 2);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Ссылка,
	               |	Контрагенты.Наименование КАК Наименование,
	               |	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
	               |	Контрагенты.КодПоЕДРПОУ КАК КодПоЕДРПОУ,
	               |	Контрагенты.ИННПлательщикаНДС КАК ИНН
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураПредставления = Новый Структура;	
	Если Выборка.Следующий() Тогда 
		Если Наименование Тогда 
			Если ЗначениеЗаполнено(Выборка.НаименованиеПолное) Тогда 
				СтруктураПредставления.Вставить("Наименование", СокрЛП(Выборка.НаименованиеПолное));
			Иначе
				СтруктураПредставления.Вставить("Наименование", СокрЛП(Выборка.Наименование));
			КонецЕсли;
		КонецЕсли;
		
		Если ИНН И ЗначениеЗаполнено(Выборка.ИНН) Тогда 
			СтруктураПредставления.Вставить("ИНН", НСтр("ru = 'ИНН '; uk = 'ІПН '", КодЯзыка) + СокрЛП(Выборка.ИНН));
		КонецЕсли;
		
		Если ЕДРПОУ И ЗначениеЗаполнено(Выборка.КодПоЕДРПОУ) Тогда 
			СтруктураПредставления.Вставить("ЕДРПОУ", НСтр("ru = 'Код по ЕГРПОУ '; uk = 'Код за ЄДРПОУ '", КодЯзыка) + СокрЛП(Выборка.КодПоЕДРПОУ));
		КонецЕсли;
		
		Если Адрес Тогда 
			ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Юридический адрес контрагента");
			тАдрес = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(Контрагент, ВидКонтактнойИнформации,, НаДату);
			тАдрес = СтрЗаменить(тАдрес," дом ", " буд "); 
			Если ЗначениеЗаполнено(тАдрес) Тогда 
				СтруктураПредставления.Вставить("Адрес", СокрЛП(тАдрес));
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Наименование Тогда 
		СтруктураПредставления.Вставить("Наименование", Строка(Контрагент));
	КонецЕсли;
	
	Если ПолучитьСтруктуру Тогда 
		Возврат СтруктураПредставления;
	Иначе		
		Для Каждого Стр Из СтруктураПредставления Цикл 
			ПредставлениеДляПечати = ?(Не ПустаяСтрока(ПредставлениеДляПечати), ПредставлениеДляПечати + Разделитель, "") + Стр.Значение;
		КонецЦикла;
		
		Возврат ПредставлениеДляПечати;	
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
